In [1]:
# Pandas, Sklearn

# Machine learning resources
# The internet. Copursera, Udemy, ...
# Nielsen Chuang's book (http://neuralnetworksanddeeplearning.com/)
# Florian Marquart's lectures (https://machine-learning-for-physicists.org/)

y(x) = a*x + b    # (x1,y1), (x2,y2), ...

In [ ]:
# feature 특징. # f(x1,x2,x3, ...., xn)

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
df = pd.read_csv('titanic_original.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
kjc = pd.DataFrame(['Korea','Japan','China'])

In [6]:
kjc

       0
0  Korea
1  Japan
2  China

In [7]:
type(kjc)

pandas.core.frame.DataFrame

In [8]:
count = ['Korea','Japan','China']
popul = [50,120,1400]
mat = [count,popul]

In [9]:
pd.DataFrame(mat)

       0      1      2
0  Korea  Japan  China
1     50    120   1400

In [10]:
pd.DataFrame(data=popul)

      0
0    50
1   120
2  1400

In [11]:
pd.DataFrame(popul,['Korea','Japan','China'])

          0
Korea    50
Japan   120
China  1400

In [12]:
df = pd.DataFrame(index=count,data=popul)

In [32]:
mat = np.random.randint(0,101,(4,3))

In [33]:
pd.DataFrame(mat)

    0   1   2
0  98  56  22
1  53  88  56
2  47  43  10
3  52  50  40

In [34]:
pd.DataFrame(mat,index = ['a','b','c','d'],columns=['A','B','C'])

    A   B   C
a  98  56  22
b  53  88  56
c  47  43  10
d  52  50  40

In [37]:
titanic = pd.read_csv('titanic_original.csv')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [43]:
titanic.iloc[10:21].iloc[:,[2,3]]

    Pclass                                               Name
10       3                    Sandstrom, Miss. Marguerite Rut
11       1                           Bonnell, Miss. Elizabeth
12       3                     Saundercock, Mr. William Henry
13       3                        Andersson, Mr. Anders Johan
14       3               Vestrom, Miss. Hulda Amanda Adolfina
15       2                   Hewlett, Mrs. (Mary D Kingcome)
16       3                               Rice, Master. Eugene
17       2                       Williams, Mr. Charles Eugene
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...
19       3                            Masselmani, Mrs. Fatima
20       2                               Fynney, Mr. Joseph J